package messages

const StartInfo = "Когнитивная психотерапия (КПТ) - подход, в основе которого лежит утверждение о том, что эмоции и поведение человека в значительной степени определяются тем, как человек воспринимает и анализирует мир. Для наглядного понимания КПТ можно представить следующей моделью"
const BeliefHelp = "Корни глубинных и промежуточных убеждений уходят в детство; в момент своего возникновения убеждение могло отражать правду, а могло и не отражать. Глубинные убеждения сохраняются и существуют благодаря схемам мышления клиента, когда он охотно принимает данные, подтверждающие глубинное убеждение, и в то же время не принимает в расчет доводы, противоречащие глубинному убеждению или преуменьшает их значимость."
const MindHelp = "Автоматические мысли — мгновенные оценочные мысли, возникающие как реакция человека на те или иные события и не являющиеся результатом размышлений, умозаключений, не обязательно опирающиеся на доказательства, но обычно принимаемые им за истину."
const SituationHelp = "Ситуацией, провоцирующей возникновение автоматических мыслей, может выступать как изменение во внешнем мире, так и внутренние переживания (размышления) человека."
const ReactionsHelp = "Результатом возникновения автоматических мыслей являются эмоции, поведение человека (сбивчивая, неуверенная речь, избегание похожих ситуаций), а также телесные реакции (напряжение в мышцах, боль)."

const BeliefButtonHelp = "глубинные и промежуточные убеждения"
const MindButtonHelp = "автоматические мысли"
const SituationButtonHelp = "ситуация"
const ReactionsButtonHelp = "реакция"
const StartButtonHelp = "к заполнению"

const NotFoundHelp = "Пожалуйста выбери вариант из списка"
