package messages

const StartInfo = "Когнитивная психотерапия (КПТ) - подход, в основе которого лежит утверждение о том, что эмоции и поведение человека в значительной степени определяются тем, как человек воспринимает и анализирует мир. \n\nДля наглядного понимания КПТ можно представить следующей моделью на изображении:\n"
const BeliefHelp = "Корни глубинных и промежуточных убеждений уходят в детство; в момент своего возникновения убеждение могло отражать правду, а могло и не отражать. \n\nГлавное, что глубинные убеждения сохраняются и существуют благодаря схемам нашего мышления:\nкогда мы охотно принимаем данные, которые подтверждают убеждение, и в то же время не принимаем в расчет доводы, которые ему противоречат.\n"
const MindHelp = "Автоматические мысли — мгновенные оценочные мысли, возникающие как наша реакция на те или иные события, которые не являются результатом размышлений, не обязательно опирающиеся на доказательства, но обычно принимаемые нами за истину.\n"
const SituationHelp = "Ситуацией, провоцирующей возникновение автоматических мыслей, может выступать как изменение во внешнем мире, так и наши внутренние переживания или размышления.\n"
const ReactionsHelp = "В результате из-за возникновения автоматических мыслей: \n– мы испытываем эмоции \n– можем замечать за собой определенное поведение: сбивчивая, неуверенная речь, избегание похожих ситуаций\n– появляются телесные реакции: напряжение в мышцах, боль, головокружение\n"

const BeliefButtonHelp = "глубинные и промежуточные убеждения"
const MindButtonHelp = "автоматические мысли"
const SituationButtonHelp = "ситуация"
const ReactionsButtonHelp = "реакция"
const StartButtonHelp = "к заполнению"

const NotFoundHelp = "Пожалуйста выбери вариант из списка"
