package messages

var MessageGreating = "Привет! Я бот, который поможет тебе вести свой КПТ дневник!"
var MessageRegister = "Для начала отошли мне идентификатор своего терапевта"
var MessageRegisterComplete = "Круто, я тебя зарегестрировал! Можешь начать мной пользоваться, для этого просто начни мне рассказывать про ситуацию"
var MessageUserNotFound = "Не нашёл такого терапевта. Проверить корректность вписанного идентификатора!"
var MessageDontRecognizeNumber = "Я не смог распознать число🙁, убедись что оно находится от 1 до 10"
var MessageCantCreatePatient = "Не получилось создать пациента, попробуй еще раз😔"

var MsgWhatHappened = "Расскажи что случилось?"
var MsgWhatMind = "Что ты подумал в этот момент?"
var MsgWhatEmotion = "Какую эмоцию ты почуствовал?"
var MsgWhatPower = "Насколько она была сильна (от 1 до 10)?"
var MsgWhatEntryDone = "Запись заполнена! Буду ждать новых записей😊 Для заполнения новой истории можешь просто написать мне ситуацию или нажать кнопку"
